using System.Collections.ObjectModel;
using System.Linq;

namespace ElectronicObserver.Utility.Data;

/// <summary>
/// 経験値テーブルを管理します。
/// </summary>
public static class ExpTable
{

	/// <summary>
	/// 経験値データを保持します。
	/// </summary>
	public class Experience
	{

		/// <summary>
		/// 現在のレベル
		/// </summary>
		public int Level { get; private set; }

		/// <summary>
		/// このレベルに到達するのに必要な累積経験値
		/// </summary>
		public int Total { get; private set; }

		/// <summary>
		/// 次のレベルに到達するのに必要な経験値
		/// </summary>
		public int Next { get; private set; }

		internal Experience(int level, int total, int next)
		{
			Level = level;
			Total = total;
			Next = next;
		}

	}


	/// <summary>
	/// 艦娘経験値テーブル
	/// </summary>
	public static ReadOnlyDictionary<int, Experience> ShipExp { get; private set; }

	/// <summary>
	/// 提督経験値テーブル
	/// </summary>
	public static ReadOnlyDictionary<int, Experience> AdmiralExp { get; private set; }

	/// <summary>
	/// 艦娘レベル最大値
	/// </summary>
	public static int ShipMaximumLevel => 185;

	/// <summary>
	/// 提督レベル最大値
	/// </summary>
	public static int AdmiralMaximumLevel => 120;


	/// <summary>
	/// 次のレベルに上がるのに必要な経験値の量を取得します。
	/// </summary>
	/// <param name="expTable">経験値テーブル。</param>
	/// <param name="current">現在の累積経験値。</param>
	private static int GetNextExp(ReadOnlyDictionary<int, Experience> expTable, int current)
	{

		Experience l = expTable.Values.FirstOrDefault(e => e.Total + e.Next > current);

		if (l == null || !expTable.ContainsKey(l.Level + 1))
			return 0;

		return expTable[l.Level + 1].Total - current;
	}


	/// <summary>
	/// 艦娘が次のレベルに上がるのに必要な経験値の量を取得します。
	/// </summary>
	/// <param name="current">現在の累積経験値。</param>
	public static int GetNextExpShip(int current)
	{
		return GetNextExp(ShipExp, current);
	}

	/// <summary>
	/// 司令部レベルが次のレベルに上がるのに必要な経験値の量を取得します。
	/// </summary>
	/// <param name="current">現在の累積経験値。</param>
	public static int GetNextExpAdmiral(int current)
	{
		return GetNextExp(AdmiralExp, current);
	}


	/// <summary>
	/// 指定したレベルに上がるのに必要な経験値の量を取得します。
	/// </summary>
	/// <param name="expTable">経験値テーブル。</param>
	/// <param name="current">現在の累積経験値。</param>
	/// <param name="level">対象のレベル。</param>
	private static int GetExpToLevel(ReadOnlyDictionary<int, Experience> expTable, int current, int level)
	{

		if (!expTable.ContainsKey(level))
			return 0;

		return expTable[level].Total - current;
	}

	/// <summary>
	/// 艦娘が指定したレベルに上がるのに必要な経験値の量を取得します。
	/// </summary>
	/// <param name="current">現在の累積経験値。</param>
	/// <param name="level">対象のレベル。</param>
	public static int GetExpToLevelShip(int current, int level)
	{
		return GetExpToLevel(ShipExp, current, level);
	}

	/// <summary>
	/// 司令部レベルが指定したレベルに上がるのに必要な経験値の量を取得します。
	/// </summary>
	/// <param name="current">現在の累積経験値。</param>
	/// <param name="level">対象のレベル。</param>
	public static int GetExpToLevelAdmiral(int current, int level)
	{
		return GetExpToLevel(AdmiralExp, current, level);
	}



	static ExpTable()
	{

		#region Initialize table

		Experience[] shipexp =
		[
			new(1, 0, 100),
			new(2, 100, 200),
			new(3, 300, 300),
			new(4, 600, 400),
			new(5, 1000, 500),
			new(6, 1500, 600),
			new(7, 2100, 700),
			new(8, 2800, 800),
			new(9, 3600, 900),
			new(10, 4500, 1000),
			new(11, 5500, 1100),
			new(12, 6600, 1200),
			new(13, 7800, 1300),
			new(14, 9100, 1400),
			new(15, 10500, 1500),
			new(16, 12000, 1600),
			new(17, 13600, 1700),
			new(18, 15300, 1800),
			new(19, 17100, 1900),
			new(20, 19000, 2000),
			new(21, 21000, 2100),
			new(22, 23100, 2200),
			new(23, 25300, 2300),
			new(24, 27600, 2400),
			new(25, 30000, 2500),
			new(26, 32500, 2600),
			new(27, 35100, 2700),
			new(28, 37800, 2800),
			new(29, 40600, 2900),
			new(30, 43500, 3000),
			new(31, 46500, 3100),
			new(32, 49600, 3200),
			new(33, 52800, 3300),
			new(34, 56100, 3400),
			new(35, 59500, 3500),
			new(36, 63000, 3600),
			new(37, 66600, 3700),
			new(38, 70300, 3800),
			new(39, 74100, 3900),
			new(40, 78000, 4000),
			new(41, 82000, 4100),
			new(42, 86100, 4200),
			new(43, 90300, 4300),
			new(44, 94600, 4400),
			new(45, 99000, 4500),
			new(46, 103500, 4600),
			new(47, 108100, 4700),
			new(48, 112800, 4800),
			new(49, 117600, 4900),
			new(50, 122500, 5000),
			new(51, 127500, 5200),
			new(52, 132700, 5400),
			new(53, 138100, 5600),
			new(54, 143700, 5800),
			new(55, 149500, 6000),
			new(56, 155500, 6200),
			new(57, 161700, 6400),
			new(58, 168100, 6600),
			new(59, 174700, 6800),
			new(60, 181500, 7000),
			new(61, 188500, 7300),
			new(62, 195800, 7600),
			new(63, 203400, 7900),
			new(64, 211300, 8200),
			new(65, 219500, 8500),
			new(66, 228000, 8800),
			new(67, 236800, 9100),
			new(68, 245900, 9400),
			new(69, 255300, 9700),
			new(70, 265000, 10000),
			new(71, 275000, 10400),
			new(72, 285400, 10800),
			new(73, 296200, 11200),
			new(74, 307400, 11600),
			new(75, 319000, 12000),
			new(76, 331000, 12400),
			new(77, 343400, 12800),
			new(78, 356200, 13200),
			new(79, 369400, 13600),
			new(80, 383000, 14000),
			new(81, 397000, 14500),
			new(82, 411500, 15000),
			new(83, 426500, 15500),
			new(84, 442000, 16000),
			new(85, 458000, 16500),
			new(86, 474500, 17000),
			new(87, 491500, 17500),
			new(88, 509000, 18000),
			new(89, 527000, 18500),
			new(90, 545500, 19000),
			new(91, 564500, 20000),
			new(92, 584500, 22000),
			new(93, 606500, 25000),
			new(94, 631500, 30000),
			new(95, 661500, 40000),
			new(96, 701500, 60000),
			new(97, 761500, 90000),
			new(98, 851500, 148500),
			new(99, 1000000, 0),
			new(100, 1000000, 10000),
			new(101, 1010000, 1000),
			new(102, 1011000, 2000),
			new(103, 1013000, 3000),
			new(104, 1016000, 4000),
			new(105, 1020000, 5000),
			new(106, 1025000, 6000),
			new(107, 1031000, 7000),
			new(108, 1038000, 8000),
			new(109, 1046000, 9000),
			new(110, 1055000, 10000),
			new(111, 1065000, 12000),
			new(112, 1077000, 14000),
			new(113, 1091000, 16000),
			new(114, 1107000, 18000),
			new(115, 1125000, 20000),
			new(116, 1145000, 23000),
			new(117, 1168000, 26000),
			new(118, 1194000, 29000),
			new(119, 1223000, 32000),
			new(120, 1255000, 35000),
			new(121, 1290000, 39000),
			new(122, 1329000, 43000),
			new(123, 1372000, 47000),
			new(124, 1419000, 51000),
			new(125, 1470000, 55000),
			new(126, 1525000, 59000),
			new(127, 1584000, 63000),
			new(128, 1647000, 67000),
			new(129, 1714000, 71000),
			new(130, 1785000, 75000),
			new(131, 1860000, 80000),
			new(132, 1940000, 85000),
			new(133, 2025000, 90000),
			new(134, 2115000, 95000),
			new(135, 2210000, 100000),
			new(136, 2310000, 105000),
			new(137, 2415000, 110000),
			new(138, 2525000, 115000),
			new(139, 2640000, 120000),
			new(140, 2760000, 127000),
			new(141, 2887000, 134000),
			new(142, 3021000, 141000),
			new(143, 3162000, 148000),
			new(144, 3310000, 155000),
			new(145, 3465000, 163000),
			new(146, 3628000, 171000),
			new(147, 3799000, 179000),
			new(148, 3978000, 187000),
			new(149, 4165000, 195000),
			new(150, 4360000, 204000),
			new(151, 4564000, 213000),
			new(152, 4777000, 222000),
			new(153, 4999000, 231000),
			new(154, 5230000, 240000),
			new(155, 5470000, 250000),
			new(156, 5720000, 60000),
			new(157, 5780000, 80000),
			new(158, 5860000, 110000),
			new(159, 5970000, 150000),
			new(160, 6120000, 200000),
			new(161, 6320000, 260000),
			new(162, 6580000, 330000),
			new(163, 6910000, 410000),
			new(164, 7320000, 500000),
			new(165, 7820000, 100000),
			new(166, 7920000, 113000),
			new(167, 8033000, 139000),
			new(168, 8172000, 178000),
			new(169, 8350000, 230000),
			new(170, 8580000, 295000),
			new(171, 8875000, 373000),
			new(172, 9248000, 457000),
			new(173, 9705000, 561000),
			new(174, 10266000, 684000),
			new(175, 10950000, 150000),
			new(176, 11100000, 200000),
			new(177, 11300000, 300000),
			new(178, 11600000, 500000),
			new(179, 12100000, 900000),
			new(180, 13000000, 200000),
			new(181, 13200000, 400000),
			new(182, 13600000, 600000),
			new(183, 14200000, 800000),
			new(184, 15000000, 1000000),
			new(185, 16000000, 0),
		];


		Experience[] admiralexp =
		[
			new(1, 0, 100),
			new(2, 100, 200),
			new(3, 300, 300),
			new(4, 600, 400),
			new(5, 1000, 500),
			new(6, 1500, 600),
			new(7, 2100, 700),
			new(8, 2800, 800),
			new(9, 3600, 900),
			new(10, 4500, 1000),
			new(11, 5500, 1100),
			new(12, 6600, 1200),
			new(13, 7800, 1300),
			new(14, 9100, 1400),
			new(15, 10500, 1500),
			new(16, 12000, 1600),
			new(17, 13600, 1700),
			new(18, 15300, 1800),
			new(19, 17100, 1900),
			new(20, 19000, 2000),
			new(21, 21000, 2100),
			new(22, 23100, 2200),
			new(23, 25300, 2300),
			new(24, 27600, 2400),
			new(25, 30000, 2500),
			new(26, 32500, 2600),
			new(27, 35100, 2700),
			new(28, 37800, 2800),
			new(29, 40600, 2900),
			new(30, 43500, 3000),
			new(31, 46500, 3100),
			new(32, 49600, 3200),
			new(33, 52800, 3300),
			new(34, 56100, 3400),
			new(35, 59500, 3500),
			new(36, 63000, 3600),
			new(37, 66600, 3700),
			new(38, 70300, 3800),
			new(39, 74100, 3900),
			new(40, 78000, 4000),
			new(41, 82000, 4100),
			new(42, 86100, 4200),
			new(43, 90300, 4300),
			new(44, 94600, 4400),
			new(45, 99000, 4500),
			new(46, 103500, 4600),
			new(47, 108100, 4700),
			new(48, 112800, 4800),
			new(49, 117600, 4900),
			new(50, 122500, 5000),
			new(51, 127500, 5200),
			new(52, 132700, 5400),
			new(53, 138100, 5600),
			new(54, 143700, 5800),
			new(55, 149500, 6000),
			new(56, 155500, 6200),
			new(57, 161700, 6400),
			new(58, 168100, 6600),
			new(59, 174700, 6800),
			new(60, 181500, 7000),
			new(61, 188500, 7300),
			new(62, 195800, 7600),
			new(63, 203400, 7900),
			new(64, 211300, 8200),
			new(65, 219500, 8500),
			new(66, 228000, 8800),
			new(67, 236800, 9100),
			new(68, 245900, 9400),
			new(69, 255300, 9700),
			new(70, 265000, 10000),
			new(71, 275000, 10400),
			new(72, 285400, 10800),
			new(73, 296200, 11200),
			new(74, 307400, 11600),
			new(75, 319000, 12000),
			new(76, 331000, 12400),
			new(77, 343400, 12800),
			new(78, 356200, 13200),
			new(79, 369400, 13600),
			new(80, 383000, 14000),
			new(81, 397000, 14500),
			new(82, 411500, 15000),
			new(83, 426500, 15500),
			new(84, 442000, 16000),
			new(85, 458000, 16500),
			new(86, 474500, 17000),
			new(87, 491500, 17500),
			new(88, 509000, 18000),
			new(89, 527000, 18500),
			new(90, 545500, 19000),
			new(91, 564500, 20000),
			new(92, 584500, 22000),
			new(93, 606500, 25000),
			new(94, 631500, 30000),
			new(95, 661500, 40000),
			new(96, 701500, 60000),
			new(97, 761500, 90000),
			new(98, 851500, 148500),
			new(99, 1000000, 300000),
			new(100, 1300000, 300000),
			new(101, 1600000, 300000),
			new(102, 1900000, 300000),
			new(103, 2200000, 400000),
			new(104, 2600000, 400000),
			new(105, 3000000, 500000),
			new(106, 3500000, 500000),
			new(107, 4000000, 600000),
			new(108, 4600000, 600000),
			new(109, 5200000, 700000),
			new(110, 5900000, 700000),
			new(111, 6600000, 800000),
			new(112, 7400000, 800000),
			new(113, 8200000, 900000),
			new(114, 9100000, 900000),
			new(115, 10000000, 1000000),
			new(116, 11000000, 1000000),
			new(117, 12000000, 1000000),
			new(118, 13000000, 1000000),
			new(119, 14000000, 1000000),
			new(120, 15000000, 0)
		];

		ShipExp = new ReadOnlyDictionary<int, Experience>(shipexp.ToDictionary(exp => exp.Level));
		AdmiralExp = new ReadOnlyDictionary<int, Experience>(admiralexp.ToDictionary(exp => exp.Level));

		#endregion

	}

}
