Repository: ElectronicObserverEN/ElectronicObserver
Catalog: ElectronicObserver/Window/GeneralRes.*.resx
Languages: es_es, ko_kr

# AACITooltip
source: AA Cut-in: {0} Cut-in type: {1} ({2})
es_es: AA Cut-in: {0} Tipo de Cut-in: {1} ({2})
ko_kr: 대공 컷인: {0} 컷인 종류: {1} ({2})

source: AA Cut-in
ko_kr: 대공 컷인

# AAPower
source: AA Firepower
es_es: Defensa AA
ko_kr: 대공 포화

# AddFleetToGroupMenu
source: Add current fleet to group (&G)...
es_es: Agregar la flota actual al grupo (\&G)...
ko_kr: 현재 함대를 그룹에 추가(&G)...

source: Admiral XP
es_es: Experiencia del almirante
ko_kr: 제독 경험치

# AirPower
source: Air Superiority
es_es: Superioridad aérea
ko_kr: 제공 전력

# AirSuperiority
source: Superiority
es_es: Superioridad
ko_kr: 제공권

source: All Assigned Ships
es_es: Todos los barcos asignados
ko_kr: 전체 소속 함선

# AllComplete
source: (All quests complete!)
es_es: (¡Todas las misiones completadas!)
ko_kr: (임무 완수!)

source: Ammo
es_es: Munición
ko_kr: 탄약

# AntiAir
source: AA
ko_kr: 대공

source: Armor
es_es: Blindaje
ko_kr: 장갑

source: Arsenal
ko_kr: 공창

# ArsenalLog
source: {1} has started construction in arsenal dock #{0}. ({2}/{3}/{4}/{5}-{6} Secretary: {7})
es_es: El secretario {7} ha comenzado la construcción de {1} en el muelle n.º {0} con {2}/{3}/{4}/{5}-{6}.
ko_kr: 공창 도크 #{0}에서 {1}의 건조를 개시했습니다. ({2}/{3}/{4}/{5}-{6} 비서함: {7})

# ASTooltip
source: Supremacy: {0} Superiority: {1} Parity: {2} Denial: {3}
es_es: AS+: {0} AS: {1} AP: {2} AI: {3} ({4}: {5})
ko_kr: 확보: {0} 우세: {1} 균형: {2} 열세: {3} ({4}: {5})

source: ASW
ko_kr: 대잠

# AutoAdjustColumns
source: Automatically adjust columns (&D)
es_es: Ajustar columnas automáticamente (&D)
ko_kr: 열 자동 조정(&D)

source: Battle
es_es: Batalla
ko_kr: 전투

# CannotChangeGroup
source: Could not change the name of the group.
es_es: No se puede cambiar el nombre de este grupo.
ko_kr: 이 그룹은 이름을 변경할 수 없습니다.

# CannotDeleteGroup
source: Could not delete the group.
es_es: No se puede eliminar este grupo.
ko_kr: 이 그룹은 삭제할 수 없습니다.

source: Category
es_es: Categoría
ko_kr: 분류

# CategoryFilter
source: Category (&C)
es_es: Categoría (&C)
ko_kr: 분류(&C)

# Clear
source: Clear (&C)
es_es: Limpiar (&C)
ko_kr: 클리어(&C)

source: Compass
es_es: Brújula
ko_kr: 나침반

# CompassShipTooltip
source: {0} {1}{2} HP: {3} Firepower: {4}/{5} Torpedo: {6}/{7} AA: {8}/{9} Armor: {10}/{11} ASW: {12}/{13} Evasion: {14}/{15} LoS: {16}/{17} Luck: {18}/{19} Range: {20} / Speed: {21} (Right click for encyclopedia)
es_es: {0} {1}{2} HP: {3} Fuego: {4}/{5} Torpedo: {6}/{7} AA: {8}/{9} Blindaje: {10}/{11} ASW: {12}/{13} Evasión: {14}/{15} Detección: {16}/{17} Suerte: {18}/{19} Alcance: {20} / Velocidad: {21} (Haz clic derecho para ver en la enciclopedia)
ko_kr: {0} {1}{2} 내구: {3} 화력: {4}/{5} 뇌장: {6}/{7} 대공: {8}/{9} 장갑: {10}/{11} 대잠: {12}/{13} 회피: {14}/{15} 색적: {16}/{17} 운: {18}/{19} 사거리: {20} / 속력: {21} (우클릭으로 도감)

source: Complete
es_es: Completo
ko_kr: 완성

# Contacting
source: Made contact
es_es: Contacto establecido
ko_kr: 접촉 중

source: Create Group
es_es: Crear grupo
ko_kr: 그룹 추가

source: Current Health
es_es: Vida actual
ko_kr: 현재 내구

source: [Damaged Art Unseen]
es_es: [Ilustración dañada no vista]
ko_kr: [중파 일러스트 미회수]

source: Damage done
es_es: Daño infligido
ko_kr: 가한 데미지

# DamagePct
source: Damage %
es_es: % de daño
ko_kr: 손해율

source: Day Battle
es_es: Batalla diurna
ko_kr: 주간전

source: Defeated
es_es: Derrotado
ko_kr: 격파

# Delete
source: Delete (&D)
es_es: Eliminar (&D)
ko_kr: 삭제(&D)

# DeleteGroup
source: Delete the group [{0}]? This action cannot be undone.
es_es: ¿Eliminar el grupo [{0}]? Esta acción no se puede deshacer.
ko_kr: 그룹 [{0}]을(를) 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.

source: [Development Failed]
es_es: [Desarrollo fallido]
ko_kr: [개발 실패]

source: Dock Time
es_es: Tiempo de reparación
ko_kr: 입거 시간

# DontScrollNames
source: Do not scroll ship names (&S)
es_es: No desplazar nombres de barcos (&S)
ko_kr: 함명 스크롤하지 않기(&S)

# EncounterType
source: Encounter
es_es: Encuentro
ko_kr: 교전 형태

# EndNode
source: (End)
ko_kr: (종점)

# EnemyFleet
source: Enemy
es_es: Flota enemiga
ko_kr: 적군 함대

source: Enemy Fleet ID
es_es: ID
ko_kr: 적 함대 ID

source: Enemy Fleet Name
es_es: Nombre de la flota enemiga
ko_kr: 적 함대명

source: Enemy Formation
es_es: Formación enemiga
ko_kr: 적 진형

source: Enemy Scout
es_es: Reconocimiento enemigo
ko_kr: 적 탐지

source: (Enemy Unknown)
es_es: (No identificado)
ko_kr: (적 함대 정보 불명)

# EscortFleet
source: Escort
es_es: Escolta
ko_kr: 수반 함대

source: Evasion
es_es: Evasión
ko_kr: 회피

source: [Expedition Returned]
es_es: [Expedición regresada]
ko_kr: [원정 귀환]

# FailedToCreateCSV
source: Failed to create a ship group CSV.
es_es: Error al exportar el grupo de barcos a CSV.
ko_kr: 함선 그룹 CSV 출력에 실패했습니다.

# FatigueRestoreTime
source: Approx. {0:D2}:{1:D2} before morale fully restored.
es_es: Aprox. {0:D2}:{1:D2} para recuperación completa de moral.
ko_kr: 완전 회복까지 약 {0:D2}:{1:D2}

# FilterBy
source: Filter By (&C)
es_es: Filtro de columnas (&C)
ko_kr: 열 필터(&C)

source: Firepower
es_es: Poder de fuego
ko_kr: 화력

source: Fleet
es_es: Flota
ko_kr: 함대

# FriendlyFleet
source: Friendly
es_es: Flota aliada
ko_kr: 아군 함대

source: Friendly Formation
es_es: Formación aliada
ko_kr: 아군 진형

source: Friendly Scout
es_es: Reconocimiento aliado
ko_kr: 아군 색적

source: Fuel
ko_kr: 연료

# Initialize
source: Initialize (&I)
es_es: &Reiniciar
ko_kr: 초기화(&I)

# InitializeQuestData
source: This will initialize all quest data. Use outside of a demonstrated inconsistency is not recommended. Are you sure?
es_es: Esto restablecerá los datos de misiones. ¿Estás seguro?
ko_kr: 임무 데이터를 초기화합니다. 데이터에 불일치가 발생한 경우 외에는 사용을 권장하지 않습니다. 진행하시겠습니까?

# InitQuestTitle
source: Confirm Quest Data Initialization
es_es: Confirmar reinicio de misión
ko_kr: 임무 초기화 확인

# InProgressFilter
source: In Progress (&S)
es_es: Activos (&S)
ko_kr: 수행 중(&S)

# IsTaiha
source: Critically damaged!
es_es: ¡Daño crítico!
ko_kr: 대파 상태입니다!

source: Lock
es_es: Bloqueo
ko_kr: 잠금

source: Log
es_es: Registro
ko_kr: 로그

source: LoS
ko_kr: 탐지

source: Luck
es_es: Suerte
ko_kr: 운

source: Map
es_es: Mundo
ko_kr: 출격 해역

source: [Map Gauges]
es_es: [Medidores del mapa]
ko_kr: [해역 게이지]

source: Max Health
es_es: Salud máxima
ko_kr: 내구 최대

# ModRemaining
source: remaining
es_es: Mejoras restantes
ko_kr: 개수

source: Mysterious Item
es_es: Ítem misterioso
ko_kr: 의문의 아이템

# NameFilter
source: Name (&N)
es_es: Nombre de misión (&N)
ko_kr: 임무명(&N)

source: Next node
es_es: Nodo
ko_kr: 다음 셀

source: Night Battle
es_es: Batalla nocturna
ko_kr: 야전

source: Night Contact
es_es: Contacto nocturno:
ko_kr: 야간 접촉

# NightContacting
source: Made night contact
es_es: Contacto nocturno realizado
ko_kr: 야간 접촉 중

source: Over 50%
es_es: Más del 50%
ko_kr: 50% 이상

source: Over 80%
es_es: Más del 80%
ko_kr: 80% 이상

source: Practice
es_es: Práctica
ko_kr: 연습습

source: [Practice Report]
es_es: [Informe de práctica]
ko_kr: [연습 정보]

source: Progress
es_es: Progreso
ko_kr: 진척도

# ProgressFilter
source: Progress (&P)
es_es: Progreso (&P)
ko_kr: 진척도(&P)

# Quest
source: Quests
es_es: Misiones
ko_kr: 임무

# QuestName
source: Name
es_es: Barco:
ko_kr: 임무명

source: Range
es_es: Alcanze
ko_kr: 사정거리

# RemainingExpeds
source: {0} effective expeditions
es_es: Quedan {0} expediciones efectivas
ko_kr: 앞으로 {0}회 원정 가능

# RenameGroupMenu
source: Change group name (&R)...
es_es: Cambiar nombre del grupo (&R)...
ko_kr: 그룹 이름 변경(&R)...

source: Result
es_es: Resultados
ko_kr: 결과

source: Retreating
es_es: Retirada
ko_kr: 퇴피 중

source: Saw no enemy.
es_es: No se detectó enemigo.
ko_kr: 적 그림자 보이지 않음

source: Scouting
es_es: Exploración
ko_kr: 수색

source: Searchlight used
es_es: Foco utilizado
ko_kr: 탐조등 조사

# SecondStage
source: Stage 2
es_es: Fase 2
ko_kr: 제2차

source: Ship Girl
es_es: Barcos
ko_kr: 함娘

source: Ship ID
es_es: ID del barco
ko_kr: 함선 ID

# ShipName
source: Name
es_es: Barco:
ko_kr: 함명

source: Ship Type
es_es: Tipo de barco
ko_kr: 함종

source: Ship XP
es_es: Exp de barco
ko_kr: 함선 경험치

source: Shot Down
es_es: Derribado
ko_kr: 격추

# ShowDaily
source: Show Dailies (&D)
es_es: Diariamente (&D)
ko_kr: 데일리 임무 표시(&D)

# ShowInProgressOnly
source: Show In Progress Only (&R)
es_es: Mostrar solo en curso (&R)
ko_kr: 수행 중만 표시(&R)

# ShowMonthly
source: Show Monthlies (&M)
es_es: Mostrar misiones mensuales (&M)
ko_kr: 먼슬리 임무 표시(&M)

# ShowOneTime
source: Show One-time Quests (&O)
es_es: Mostrar misiones únicas (&O)
ko_kr: 일회성 임무 표시(&O)

# ShowWeekly
source: Show Weeklies (&W)
es_es: Semanal (\&W)
ko_kr: 위클리 임무 표시(&W)

# SortiePlace
source: Sortie Location
es_es: Ubicación de salida
ko_kr: 출격지

# SpecifySelectGroup
source: Select the group to add to:
es_es: Selecciona el grupo al que deseas agregar:
ko_kr: 추가할 그룹을 선택하세요:

source: Speed
es_es: Velocidad
ko_kr: 속력

source: Star Shell used
es_es: Bengala utilizada
ko_kr: 조명탄 투사

# SVictory
source: S Rank
es_es: Victoria S
ko_kr: S승리

source: times
es_es: Veces
ko_kr: 회

# TimeToCompletion
source: Completion time
es_es: Hora de finalización
ko_kr: 완료 일시

# ToX
source: To Level {0}: {1}
es_es: Hasta nivel {0}: {1}
ko_kr: Lv{0}까지: {1}

# To99
source: To Level 99: {0}
es_es: Hasta nivel 99: {0}
ko_kr: Lv99까지: {0}

# ToHeavy
source: To Critical Damage: {0}
es_es: Hasta daño crítico: {0}
ko_kr: 대파까지: {0}

# ToMidAndHeavy
source: To Moderate Damage: {0} / To Critical Damage: {1}
es_es: Hasta daño moderado: {0} Hasta daño crítico: {1}
ko_kr: 중파까지: {0} / 대파까지: {1}

# ToNextLevel
source: To Next Level: {0}
es_es: Hasta el siguiente nivel: {0}
ko_kr: 다음 레벨까지: {0}

# ToRemodel
source: To Remodel: {0} levels / {1} exp.
es_es: Para remodelar: {0} niveles / {1} exp.
ko_kr: 개장까지: Lv. {0} / {1} exp.

source: Torpedo
ko_kr: 뇌장

# TotalExperienceGained
source: XP Gain
es_es: Ganancia de XP
ko_kr: 획득 경험치

source: Total LoS
ko_kr: 색적 능력

source: Type
es_es: Tipo
ko_kr: 종류

# TypeFilter
source: Type (&T)
es_es: Tipo (\&T)
ko_kr: 출현 유형(&T)

source: Unique ID
es_es: ID único
ko_kr: 고유 ID

# UnseenEquips
source: [Unseen Equipment]
es_es: [Equipo no visto]
ko_kr: [미보유 장비]

source: [Unseen Ships]
es_es: [Barcos no vistos]
ko_kr: [미보유 함]

source: Why did this happen.
es_es: ¿Por qué ocurrió esto?
ko_kr: 왜 이렇게 됐지

source: Window Capture
es_es: Captura de ventana
ko_kr: 윈도우 캡쳐

# WindowCaptureInst
source: Drag and drop this icon to the window you wish to capture.
es_es: Arrastra y suelta este icono en la ventana que deseas capturar.
ko_kr: 캡처할 윈도우로 아이콘을 드래그 앤 드롭하세요.

# WinRank
source: Battle Rank
es_es: Rango de batalla
ko_kr: 전적 판정

# AllData
source: All Data (&A)
es_es: Todos los datos (\&A)
ko_kr: 모두(&A)

# Baux
source: Bauxite
es_es: Bauxita
ko_kr: 보크사이

# Bucket
source: Instant Repair
es_es: Reparación instantánea
ko_kr: 고속 수복재

# Day
source: Day (&D)
es_es: Día (\&D)
ko_kr: 일(&D)

# DevMat
source: Development Material
es_es: Material de desarrollo
ko_kr: 개발 자재

source: (difference)
es_es: (diferencia)
ko_kr: (차분)

source: Experience
es_es: Experiencia
ko_kr: 경험치

# Flamethrower
source: Instant Construction
es_es: Construcción instantánea
ko_kr: 고속 건조재

# ImpMat
source: Improvement Material
es_es: Material de mejora
ko_kr: 개수 자재

source: Materials
es_es: Materiales
ko_kr: 자재

# Month
source: Month (&M)
es_es: Mes (&M)
ko_kr: 월(&M)

source: Resource Chart
es_es: Gráfico de recursos
ko_kr: 자원 차트

source: Steel
es_es: Acero
ko_kr: 강재

# ThreeMonths
source: 3 Months (&S)
es_es: 3 Meses (&S)
ko_kr: 3달(&S)

# Week
source: Week (&W)
es_es: &Semana
ko_kr: 주(&W)

# Year
source: Year (&Y)
es_es: &Año
ko_kr: 년(&Y)

source: Aerial Recon
es_es: Reconocimiento aéreo
ko_kr: 항공 탐색

source: Failure
es_es: Fallo
ko_kr: 실패

source: Great Success
es_es: Gran éxito
ko_kr: 대성공

source: Success
es_es: Éxito
ko_kr: 성공

source: Expansion
es_es: Expansión
ko_kr: 보강

# ChangeTooltip
source: Today: {0:+##;-##;±0} This week: {1:+##;-##;±0} This month: {2:+##;-##;±0}
es_es: Hoy: {0:+##;-##;±0} Esta semana: {1:+##;-##;±0} Este mes: {2:+##;-##;±0}
ko_kr: 오늘: {0:+##;-##;±0} 이번 주: {1:+##;-##;±0} 이번 달: {2:+##;-##;±0}

source: Battle Complete
es_es: Batalla Completada
ko_kr: 전투 종료

# EnemyName
source: Enemy Name: {0}
es_es: Nombre del enemigo: {0}
ko_kr: 적 함대명: {0}

# NoSecondAirStage
source: (Second air stage did not activate.)
es_es: (La segunda fase aérea no se activó)
ko_kr: (제2차 전 발생 안 함)

# EnemyCandidate
source: Fleet Candidate
es_es: Fuerza enemiga posible
ko_kr: 적 함대 후보

# NoFleetCandidates
source: (No Enemy Fleet Candidates)
es_es: (Sin flotas enemigas candidatas)
ko_kr: (적 함대 후보 없음)

# BauxiteUsage
source: Bauxite: {0} ( {1} planes )
es_es: Bauxita: {0} ( {1} aviones )
ko_kr: 보크사이트: {0} ( {1}기 )

source: [Fleet Returned]
es_es: [Flota regresada]
ko_kr: [함대 귀환]

source: [Resupply Complete]
es_es: [Reabastecimiento completo]
ko_kr: [보급 완료]

# ResupplyString
source: Fuel: {0} (resupply) + {1} (repair) = {2} Ammo: {3} Steel: {4} Bauxite: {5} ( {6} planes )
es_es: Fuel: {0:+0;-0} ( regen {1:+0;-0} - resurtido {2} - reparación {3} ) Munición: {4:+0;-0} ( regen {5:+0;-0} - resurtido {6} ) Acero: {7:+0;-0} ( regen {8:+0;-0} - reparación {9} ) Bauxita: {10:+0;-0} ( regen {11:+0;-0} - resurtido {12} ( {13} aviones ) )
ko_kr: 연료: {0:+0;-0} ( 자연 {1:+0;-0} - 보급 {2} - 입거{3} ) 탄약: {4:+0;-0} ( 자연 {5:+0;-0} - 보급 {6} ) 강재: {7:+0;-0} ( 자연 {8:+0;-0} - 입거 {9} ) 보크사이트: {10:+0;-0} ( 자연 {11:+0;-0} - 보급 {12} ( {13} 기 ) )

source: Bombers
es_es: Bombarderos
ko_kr: 폭장

# Planes
source: Aircraft
es_es: Aeronaves
ko_kr: 함재기

source: Total
ko_kr: 합계

source: Air
es_es: Aire
ko_kr: 항공

source: Bombing
es_es: Bombardeo
ko_kr: 공격

source: Power
es_es: Potencia
ko_kr: 위력

# Remove
source: Remove (&E)
es_es: Eliminar (&E)
ko_kr: 제외(&E)

source: Shelling
es_es: Bombardeo
ko_kr: 포격

# AutoSortDialogError
source: ShipGroup: There was an error with the auto-sort settings dialog.
es_es: ShipGroup: Se ha producido un error en el cuadro de diálogo de ordenación automática.
ko_kr: ShipGroup: 자동 정렬 설정 창에서 에러가 발생했습니다.

# CopyGroupText
source: Enter the desired group name:
es_es: Introduce el nombre del grupo deseado:
ko_kr: 그룹 명을 입력해주세요 :

# CopyGroupTitle
source: Copy Group
es_es: Copiar grupo
ko_kr: 그룹을 복사

# TotalShips
source: Total: {0} ships
es_es: Total: {0} barcos
ko_kr: 소속: {0}척

# KancolleMustBeLoaded
source: Please load Kancolle before opening the records.
es_es: Por favor, carga KanColle antes de abrir los registros.
ko_kr: 칸코레를 실행한 후 시도해주세요.

# NoBuildData
source: There is no construction data.
es_es: No hay datos de construcción.
ko_kr: 건조 기록이 없습니다.

# NoDevData
source: There is no development data.
es_es: No hay datos de desarrollo.
ko_kr: 개발 기록이 없습니다.

# NoDropData
source: There is no drop data.
es_es: No hay datos de drops
ko_kr: 드랍 기록이 없습니다.

source: No Master Data
es_es: No hay datos maestros
ko_kr: 마스터 데이터가 없습니다.
